Autodesk.Revit.DB.ExportLineweightTable.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.ExportLineweightTable.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.ExportLineweightTable.GetExportLineweightTableIterator
Returns a line weight table iterator to the line weight table.

Autodesk.Revit.DB.ExportLineweightTable.Clear
Removes all contents stored in Export line weight table.

Autodesk.Revit.DB.ExportLineweightTable.Remove(Autodesk.Revit.DB.ExportLineweightKey)
Removes the pair (key, info) corresponding to the given ExportLineweightKey.
exportLineweightKey:
The export line weight key
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ExportLineweightTable.Add(Autodesk.Revit.DB.ExportLineweightKey,Autodesk.Revit.DB.ExportLineweightInfo)
Inserts a (key, info) pair into Export line weight table.
exportLineweightKey:
The export line weight Key to be added.
exportLineweightInfo:
The export line weight info to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The key already exists in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ExportLineweightTable.GetValues
Returns all the values stored in the map.
Returns:
The info.

Autodesk.Revit.DB.ExportLineweightTable.GetKeys
Gets all the keys stored in the map.
Returns:
The keys.

Autodesk.Revit.DB.ExportLineweightTable.GetExportLineweightInfo(Autodesk.Revit.DB.ExportLineweightKey)
Gets a copy of the ExportLineweightInfo corresponding to the given ExportLineweightKey.
exportLineweightKey:
The export line weight Key.
Returns:
Returns the line weight info for this key.
Throws Autodesk.Revit.Exceptions.ArgumentException:
An entry with the given key is not present in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ExportLineweightTable.ContainsKey(Autodesk.Revit.DB.ExportLineweightKey)
Checks whether a line weight key exists in the table.
exportLineweightKey:
The export line weight key.
Returns:
True if the line weight exists in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ExportLineweightTable.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExportLineweightTable.Count
Count of the items contained in the collection.

Autodesk.Revit.DB.ExportLineweightTable.default(Autodesk.Revit.DB.ExportLineweightKey)
A copy of the Autodesk.Revit.DB.ExportLineweightInfo for the line weight's Autodesk.Revit.DB.ExportLineweightKey.
Remarks: When getting this property, it returns a copy of the Autodesk.Revit.DB.ExportLineweightInfo from the table.  In order to
make changes to the Autodesk.Revit.DB.ExportLineweightInfo and use those settings during export, set the modified
Autodesk.Revit.DB.ExportLineweightInfo back into the table using the same key.
ExportLineweightKey:
The key.
Returns:
A copy of the Autodesk.Revit.DB.ExportLineweightInfo.
Throws Autodesk.Revit.Exceptions.ArgumentException: When getting this property:
An entry with the given key is not present in the table.
Since:
2014

Autodesk.Revit.DB.ExportLineweightTable.GetLineweightTableIterator
Returns a ExportLineweightTableIterator that iterates through the collection.
Returns: A ExportLineweightTableIterator object that can be used to iterate through key-value pairs in the collection.

Autodesk.Revit.DB.ExportLineweightTable.#ctor
Constructs a new ExportLineweightTable with default settings.

Autodesk.Revit.DB.ExportLineweightTable
A table supporting a mapping of line weights in Revit to line weight names that will be set
in the target export format.
Remarks:
This table is structured as a mapping from Autodesk.Revit.DB.ExportLineweightKey to
Autodesk.Revit.DB.ExportLineweightInfo members.  The Autodesk.Revit.DB.ExportLineweightKey
contains the indentification information for the pattern table: the Revit line weight.  The
Autodesk.Revit.DB.ExportLineweightInfo contains the line weight to use in the export format.
The table can be accessed via direct iteration as a collection of KeyValuePairs, or by traversal of the stored keys
obtained from GetKeys(), or via specific lookup of a key constructed externally.  In all cases, the
Autodesk.Revit.DB.ExportLineweightInfo returned will be a copy of the Autodesk.Revit.DB.ExportLineweightInfo
from the table.  In order to make changes to the Autodesk.Revit.DB.ExportLineweightInfo and use those settings during export,
set the modified Autodesk.Revit.DB.ExportLineweightInfo back into the table using the same key.